org/github-emacs-action.org
#+HUGO_BASE_DIR: ../
#+TITLE: GitHub Emacs Action
#+DATE: <2021-08-04 Wed 18:05>
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_TAGS: 
#+HUGO_CATEGORIES: 
#+HUGO_DRAFT: false
This is a GitHub Action example to set up Emacs with your packages.

Since that Emacs setup uses [[./nix.org][Nix]], Nix will be installed automatically if
necessary, along with the "cachix" tool which enables downloads of the cached
binaries. ([[https://github.com/purcell/setup-emacs][via]])

-> https://github.com/jsntn/emacs-actions

* The 'ox-publish' case

-> https://github.com/jsntn/emacs-actions/tree/ox-publish

It uses GitHub Action [[https://github.com/peaceiris/actions-gh-pages][@peaceiris/actions-gh-pages]] to deploy static files to
GitHub Pages. This deploy action can be combined simply and freely with Static
Site Generators. (Hugo, MkDocs, Gatsby, mdBook, Next, Nuxt, and so on.)

The 'ox-publish' package is managed and configured in [[https://github.com/jsntn/emacs-actions/blob/18e45d1a0f40b4fdffaf0b98ead9b8d451794ecd/scripts/config.el][config.el]].

* The =org-html-export-to-html= case

-> https://github.com/jsntn/emacs-actions/tree/org-to-html

A 'gh-pages' deployment use case can be found from [[https://github.com/blurtOut/bo1/blob/c2d93fc614f55b1e260dd499dabf8b6b429f4d92/.github/workflows/main.yml#L27][here]].

* Demo

- https://github.com/jsntn/note.jsntn.com
- https://github.com/giveupenglishOrg/sse.lyce.info
- https://github.com/blurtOut/bo1
